IDEA StatiCa Open Model
LineSupportSegment.Segment Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Reference to geometrical segment3D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement Segment { get; set; }
Public Property Segment As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ Segment {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
LineSupportSegment Class
IdeaRS.OpenModel.Model Namespace